cmsis-svd/cmsis-svd/data/STMicro/STM32WBxx_CM4.svd
            <register>
               <name>HFSR</name>
               <displayName>HFSR</displayName>
               <description>Hard fault status register</description>
               <addressOffset>0x2C</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>VECTTBL</name>
                     <description>Vector table hard fault</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FORCED</name>
                     <description>Forced hard fault</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DEBUG_VT</name>
                     <description>Reserved for Debug use</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MMFAR</name>
               <displayName>MMFAR</displayName>
               <description>Memory management fault address           register</description>
               <addressOffset>0x34</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>MMFAR</name>
                     <description>Memory management fault               address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>BFAR</name>
               <displayName>BFAR</displayName>
               <description>Bus fault address register</description>
               <addressOffset>0x38</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>BFAR</name>
                     <description>Bus fault address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>AFSR</name>
               <displayName>AFSR</displayName>
               <description>Auxiliary fault status           register</description>
               <addressOffset>0x3C</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>IMPDEF</name>
                     <description>Implementation defined</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
         </registers>
      </peripheral>
      <peripheral>
         <name>STK</name>
         <description>SysTick timer</description>
         <groupName>STK</groupName>
         <baseAddress>0xE000E010</baseAddress>
         <addressBlock>
            <offset>0x0</offset>
            <size>0x11</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <name>CTRL</name>
               <displayName>CTRL</displayName>
               <description>SysTick control and status           register</description>
               <addressOffset>0x0</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0X00000000</resetValue>
               <fields>
                  <field>
                     <name>ENABLE</name>
                     <description>Counter enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TICKINT</name>
                     <description>SysTick exception request               enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CLKSOURCE</name>
                     <description>Clock source selection</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>COUNTFLAG</name>
                     <description>COUNTFLAG</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>LOAD</name>
               <displayName>LOAD</displayName>
               <description>SysTick reload value register</description>
               <addressOffset>0x4</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0X00000000</resetValue>
               <fields>
                  <field>
                     <name>RELOAD</name>
                     <description>RELOAD value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>24</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>VAL</name>
               <displayName>VAL</displayName>
               <description>SysTick current value register</description>
               <addressOffset>0x8</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0X00000000</resetValue>
               <fields>
                  <field>
                     <name>CURRENT</name>
                     <description>Current counter value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>24</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CALIB</name>
               <displayName>CALIB</displayName>
               <description>SysTick calibration value           register</description>
               <addressOffset>0xC</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0X00000000</resetValue>
               <fields>
                  <field>
                     <name>TENMS</name>
                     <description>Calibration value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>24</bitWidth>
                  </field>
                  <field>
                     <name>SKEW</name>
                     <description>SKEW flag: Indicates whether the TENMS               value is exact</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NOREF</name>
                     <description>NOREF flag. Reads as zero</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
